---
title: Metal
classe: Autodesk.Revit.DB.Visual.Metal
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# Metal

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Metal.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Metal.CommonTintToggle` | String |
| `String MetalColor { get; }` | `Metal.MetalColor` | String |
| `String MetalFinish { get; }` | `Metal.MetalFinish` | String |
| `String MetalPatina { get; }` | `Metal.MetalPatina` | String |
| `String MetalPattern { get; }` | `Metal.MetalPattern` | String |
| `String MetalPatternHeight { get; }` | `Metal.MetalPatternHeight` | String |
| `String MetalPatternScale { get; }` | `Metal.MetalPatternScale` | String |
| `String MetalPatternShader { get; }` | `Metal.MetalPatternShader` | String |
| `String MetalPerforations { get; }` | `Metal.MetalPerforations` | String |
| `String MetalPerforationsCenter { get; }` | `Metal.MetalPerforationsCenter` | String |
| `String MetalPerforationsShader { get; }` | `Metal.MetalPerforationsShader` | String |
| `String MetalPerforationsSize { get; }` | `Metal.MetalPerforationsSize` | String |
| `String MetalType { get; }` | `Metal.MetalType` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```